/*************************************************************************
	> File Name: main.c
	> Author: cyf
	> Mail: 1097189275@qq.com 
	> Created Time: 2016年03月26日 星期六 13时34分26秒
 ************************************************************************/

#include <stdio.h>
/*
 * 一个整型数组里除了两个数字之外，其他的数字都出现了两次，请写程序找出这两个出现一次的数字，要求时间复杂度为O(n),空间复杂度是O(1)
 * 例如：[2, 4, 3, 6, 3, 2, 5, 5]->[4, 6]
 * */

int main()
{
	int data[8] = {
		2, 4, 3, 6, 3, 2, 5, 5
	};
	int num1, num2;
	FindNumsAppearOnce(data, 8, &num1, &num2);
	printf("num1:%d,num2:%d\n", num1, num2);
}
